from colorama import init, Fore, Style
init(autoreset=True)


# -------------------------------
# Меню регистрации
# -------------------------------
Register_menu = f'''{Fore.YELLOW}______________________________________________________________


             {Fore.LIGHTMAGENTA_EX} М Е Н Ю   Р Е Г И С Т Р А Ц И И 
{Fore.YELLOW}______________________________________________________________


                    {Fore.CYAN}1 - регистрация
                    {Fore.GREEN}2 - вход
                    {Fore.RED}3 - удаление аккаунта
                    {Fore.MAGENTA}0 - выход

                   {Fore.WHITE}Выберите пункт меню:

{Fore.YELLOW}______________________________________________________________'''


# -------------------------------
# Поле боя
# -------------------------------
Game_field = ' ' + '__________________________________________________________________________________________' + ' ' + '\n'
Game_field +=  '|' + Fore.RED + '■' * 40 + Style.RESET_ALL + ' ' * 10 +  Fore.BLUE + '■' * 40 + Style.RESET_ALL + '|'

count = 0
for _ in range(62):
    count += 1
    if count == 54:
        Game_field += '\n'
        Game_field +=  '|' + Fore.RED + '■' * 40 + Style.RESET_ALL + ' ' * 10 +  Fore.BLUE + '■' * 40 + Style.RESET_ALL + '|' + '\n'
        Game_field += '|__________________________________________________________________________________________|'
    else:
        Game_field += '\n|                                                                                          |'
Game_field += '\n'
Game_field += ' ' + '-' * 90 + ' '

# -------------------------------
# Главное меню игры
# -------------------------------
Game_menu = f'''{Fore.YELLOW}____________________________________________________________________________________________
|                                                                                          |
|                                   {Fore.CYAN}М Е Н Ю   И Г Р Ы                                      |
|                                                                                          |
|                                  {Fore.LIGHTRED_EX}1 - Начать бой ⚔️                                       |
|                                  {Fore.GREEN}2 - Войти в инвентарь 🧰                                |
|                                  {Fore.YELLOW}3 - Настройки аккаунта ⚙️                               |
|                                  {Fore.MAGENTA}4 - Открыть магазин 🛒                                  |
|                                  {Fore.CYAN}0 - Выход из игры ❌                                    |
|                                                                                          |
|                                  {Fore.WHITE}Выберите пункт меню:                                    |
|                                                                                          |
{Fore.YELLOW}____________________________________________________________________________________________'''


bear = '''_/□\\_
ʕ•ᴥ•ʔ'''

cat = '''/\\_/\\
(•·•)'''

bunny = '''(\\_/)
(•×•)'''

pig  = '''()_()
(ˆ(oo)ˆ)'''
print(bunny)